
* TODOS
** TODO Create environment variable for database
** TODO Create environment variable for JWT salt

* Auth

** Register

#+begin_src restclient
POST http://localhost:8000/users
Content-Type: application/json
{
    "email": "email@gmail.com",
    "password": "examplePassword"
}
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
{
  "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoxM30sImlhdCI6MTYwNDE1Nzk4MiwiZXhwIjoxNjA0NTE3OTgyfQ.ZtvoZIH6y0o4YJWtGEAe_fM8OgT7luwOMy0Id4eDQ94",
  "user": {
    "email": "email@gmail.com",
    "password": "$2b$10$Vdz90uFNOwtS3.Z8aKXCleSaQ7/KD/.OxFAY1OgTao0EWt3dVphRu",
    "id": 13
  }
}
// POST http://localhost:8000/users
// HTTP/1.1 200 OK
// X-Powered-By: Express
// Content-Type: application/json; charset=utf-8
// Content-Length: 280
// ETag: W/"118-LLSyahNlJ0SP+6fypCiOeLlQaCU"
// Date: Sat, 31 Oct 2020 15:26:22 GMT
// Connection: keep-alive
// Request duration: 0.218814s
,#+END_SRC
#+end_example

** Login

#+begin_src restclient
POST http://localhost:8000/users/login
Content-Type: application/json
{
    "email": "zulfiqar.soomro@gmail.co",
    "password": "examplePassword"
}
#+end_src

#+RESULTS:
#+BEGIN_SRC js
{
  "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjo1fSwiaWF0IjoxNjAzMDc3MzM1LCJleHAiOjE2MDMwNzgyMzV9.wQ56trtEHBtarcv2ClYU0ms4Zti9wpE_1GDbwlUI4zo"
}
// POST http://localhost:8000/users/login
// HTTP/1.1 200 OK
// X-Powered-By: Express
// Content-Type: application/json; charset=utf-8
// Content-Length: 161
// ETag: W/"a1-CTqjhuvbfHDGeDnVgmDHNMll95I"
// Date: Mon, 19 Oct 2020 03:15:35 GMT
// Connection: keep-alive
// Request duration: 0.067611s
#+END_SRC

** Load User

#+begin_src restclient
GET http://localhost:8000/users/loadUser
Content-Type: application/json
x-auth-token:  eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjo0fSwiaWF0IjoxNjAzNzI1MjIxLCJleHAiOjE2MDQwODUyMjF9.RLEvpRkAIuecm0SXFtVe-Jw058sQGERf7cW_x2BlDko
#+end_src

#+RESULTS:
#+BEGIN_SRC js
{
  "user": [
    {
      "id": 4,
      "email": "zulfiqar.soomro@ecountabl.co",
      "podId": null,
      "password": "$2b$10$OdX5XaVqva1nPREGsNcxLO9g9AVTE1NqDSJoBmVyBy49206dttJcy"
    }
  ]
}
// GET http://localhost:8000/users/loadUser
// HTTP/1.1 200 OK
// X-Powered-By: Express
// Content-Type: application/json; charset=utf-8
// Content-Length: 145
// ETag: W/"91-MTlQ9VUhYH1v8lFQDi061hTlG8M"
// Date: Mon, 26 Oct 2020 15:15:25 GMT
// Connection: keep-alive
// Request duration: 0.009105s
#+END_SRC
